----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1      [4, 64, 32, 112, 192]           9,408
       BatchNorm3d-2      [4, 64, 32, 112, 192]             128
              ReLU-3      [4, 64, 32, 112, 192]               0
            Conv3d-4      [4, 64, 16, 112, 192]          28,672
       BatchNorm3d-5      [4, 64, 16, 112, 192]             128
              ReLU-6      [4, 64, 16, 112, 192]               0
         SepConv3d-7      [4, 64, 16, 112, 192]               0
         MaxPool3d-8        [4, 64, 16, 56, 96]               0
            Conv3d-9        [4, 64, 16, 56, 96]           4,096
      BatchNorm3d-10        [4, 64, 16, 56, 96]             128
             ReLU-11        [4, 64, 16, 56, 96]               0
      BasicConv3d-12        [4, 64, 16, 56, 96]               0
           Conv3d-13       [4, 192, 16, 56, 96]         110,592
      BatchNorm3d-14       [4, 192, 16, 56, 96]             384
             ReLU-15       [4, 192, 16, 56, 96]               0
           Conv3d-16       [4, 192, 16, 56, 96]         110,592
      BatchNorm3d-17       [4, 192, 16, 56, 96]             384
             ReLU-18       [4, 192, 16, 56, 96]               0
        SepConv3d-19       [4, 192, 16, 56, 96]               0
        MaxPool3d-20       [4, 192, 16, 28, 48]               0
           Conv3d-21        [4, 64, 16, 28, 48]          12,288
      BatchNorm3d-22        [4, 64, 16, 28, 48]             128
             ReLU-23        [4, 64, 16, 28, 48]               0
      BasicConv3d-24        [4, 64, 16, 28, 48]               0
           Conv3d-25        [4, 96, 16, 28, 48]          18,432
      BatchNorm3d-26        [4, 96, 16, 28, 48]             192
             ReLU-27        [4, 96, 16, 28, 48]               0
      BasicConv3d-28        [4, 96, 16, 28, 48]               0
           Conv3d-29       [4, 128, 16, 28, 48]         110,592
      BatchNorm3d-30       [4, 128, 16, 28, 48]             256
             ReLU-31       [4, 128, 16, 28, 48]               0
           Conv3d-32       [4, 128, 16, 28, 48]          49,152
      BatchNorm3d-33       [4, 128, 16, 28, 48]             256
             ReLU-34       [4, 128, 16, 28, 48]               0
        SepConv3d-35       [4, 128, 16, 28, 48]               0
           Conv3d-36        [4, 16, 16, 28, 48]           3,072
      BatchNorm3d-37        [4, 16, 16, 28, 48]              32
             ReLU-38        [4, 16, 16, 28, 48]               0
      BasicConv3d-39        [4, 16, 16, 28, 48]               0
           Conv3d-40        [4, 32, 16, 28, 48]           4,608
      BatchNorm3d-41        [4, 32, 16, 28, 48]              64
             ReLU-42        [4, 32, 16, 28, 48]               0
           Conv3d-43        [4, 32, 16, 28, 48]           3,072
      BatchNorm3d-44        [4, 32, 16, 28, 48]              64
             ReLU-45        [4, 32, 16, 28, 48]               0
        SepConv3d-46        [4, 32, 16, 28, 48]               0
        MaxPool3d-47       [4, 192, 16, 28, 48]               0
           Conv3d-48        [4, 32, 16, 28, 48]           6,144
      BatchNorm3d-49        [4, 32, 16, 28, 48]              64
             ReLU-50        [4, 32, 16, 28, 48]               0
      BasicConv3d-51        [4, 32, 16, 28, 48]               0
         Mixed_3b-52       [4, 256, 16, 28, 48]               0
           Conv3d-53       [4, 128, 16, 28, 48]          32,768
      BatchNorm3d-54       [4, 128, 16, 28, 48]             256
             ReLU-55       [4, 128, 16, 28, 48]               0
      BasicConv3d-56       [4, 128, 16, 28, 48]               0
           Conv3d-57       [4, 128, 16, 28, 48]          32,768
      BatchNorm3d-58       [4, 128, 16, 28, 48]             256
             ReLU-59       [4, 128, 16, 28, 48]               0
      BasicConv3d-60       [4, 128, 16, 28, 48]               0
           Conv3d-61       [4, 192, 16, 28, 48]         221,184
      BatchNorm3d-62       [4, 192, 16, 28, 48]             384
             ReLU-63       [4, 192, 16, 28, 48]               0
           Conv3d-64       [4, 192, 16, 28, 48]         110,592
      BatchNorm3d-65       [4, 192, 16, 28, 48]             384
             ReLU-66       [4, 192, 16, 28, 48]               0
        SepConv3d-67       [4, 192, 16, 28, 48]               0
           Conv3d-68        [4, 32, 16, 28, 48]           8,192
      BatchNorm3d-69        [4, 32, 16, 28, 48]              64
             ReLU-70        [4, 32, 16, 28, 48]               0
      BasicConv3d-71        [4, 32, 16, 28, 48]               0
           Conv3d-72        [4, 96, 16, 28, 48]          27,648
      BatchNorm3d-73        [4, 96, 16, 28, 48]             192
             ReLU-74        [4, 96, 16, 28, 48]               0
           Conv3d-75        [4, 96, 16, 28, 48]          27,648
      BatchNorm3d-76        [4, 96, 16, 28, 48]             192
             ReLU-77        [4, 96, 16, 28, 48]               0
        SepConv3d-78        [4, 96, 16, 28, 48]               0
        MaxPool3d-79       [4, 256, 16, 28, 48]               0
           Conv3d-80        [4, 64, 16, 28, 48]          16,384
      BatchNorm3d-81        [4, 64, 16, 28, 48]             128
             ReLU-82        [4, 64, 16, 28, 48]               0
      BasicConv3d-83        [4, 64, 16, 28, 48]               0
         Mixed_3c-84       [4, 480, 16, 28, 48]               0
        MaxPool3d-85        [4, 480, 8, 14, 24]               0
           Conv3d-86        [4, 192, 8, 14, 24]          92,160
      BatchNorm3d-87        [4, 192, 8, 14, 24]             384
             ReLU-88        [4, 192, 8, 14, 24]               0
      BasicConv3d-89        [4, 192, 8, 14, 24]               0
           Conv3d-90         [4, 96, 8, 14, 24]          46,080
      BatchNorm3d-91         [4, 96, 8, 14, 24]             192
             ReLU-92         [4, 96, 8, 14, 24]               0
      BasicConv3d-93         [4, 96, 8, 14, 24]               0
           Conv3d-94        [4, 208, 8, 14, 24]         179,712
      BatchNorm3d-95        [4, 208, 8, 14, 24]             416
             ReLU-96        [4, 208, 8, 14, 24]               0
           Conv3d-97        [4, 208, 8, 14, 24]         129,792
      BatchNorm3d-98        [4, 208, 8, 14, 24]             416
             ReLU-99        [4, 208, 8, 14, 24]               0
       SepConv3d-100        [4, 208, 8, 14, 24]               0
          Conv3d-101         [4, 16, 8, 14, 24]           7,680
     BatchNorm3d-102         [4, 16, 8, 14, 24]              32
            ReLU-103         [4, 16, 8, 14, 24]               0
     BasicConv3d-104         [4, 16, 8, 14, 24]               0
          Conv3d-105         [4, 48, 8, 14, 24]           6,912
     BatchNorm3d-106         [4, 48, 8, 14, 24]              96
            ReLU-107         [4, 48, 8, 14, 24]               0
          Conv3d-108         [4, 48, 8, 14, 24]           6,912
     BatchNorm3d-109         [4, 48, 8, 14, 24]              96
            ReLU-110         [4, 48, 8, 14, 24]               0
       SepConv3d-111         [4, 48, 8, 14, 24]               0
       MaxPool3d-112        [4, 480, 8, 14, 24]               0
          Conv3d-113         [4, 64, 8, 14, 24]          30,720
     BatchNorm3d-114         [4, 64, 8, 14, 24]             128
            ReLU-115         [4, 64, 8, 14, 24]               0
     BasicConv3d-116         [4, 64, 8, 14, 24]               0
        Mixed_4b-117        [4, 512, 8, 14, 24]               0
          Conv3d-118        [4, 160, 8, 14, 24]          81,920
     BatchNorm3d-119        [4, 160, 8, 14, 24]             320
            ReLU-120        [4, 160, 8, 14, 24]               0
     BasicConv3d-121        [4, 160, 8, 14, 24]               0
          Conv3d-122        [4, 112, 8, 14, 24]          57,344
     BatchNorm3d-123        [4, 112, 8, 14, 24]             224
            ReLU-124        [4, 112, 8, 14, 24]               0
     BasicConv3d-125        [4, 112, 8, 14, 24]               0
          Conv3d-126        [4, 224, 8, 14, 24]         225,792
     BatchNorm3d-127        [4, 224, 8, 14, 24]             448
            ReLU-128        [4, 224, 8, 14, 24]               0
          Conv3d-129        [4, 224, 8, 14, 24]         150,528
     BatchNorm3d-130        [4, 224, 8, 14, 24]             448
            ReLU-131        [4, 224, 8, 14, 24]               0
       SepConv3d-132        [4, 224, 8, 14, 24]               0
          Conv3d-133         [4, 24, 8, 14, 24]          12,288
     BatchNorm3d-134         [4, 24, 8, 14, 24]              48
            ReLU-135         [4, 24, 8, 14, 24]               0
     BasicConv3d-136         [4, 24, 8, 14, 24]               0
          Conv3d-137         [4, 64, 8, 14, 24]          13,824
     BatchNorm3d-138         [4, 64, 8, 14, 24]             128
            ReLU-139         [4, 64, 8, 14, 24]               0
          Conv3d-140         [4, 64, 8, 14, 24]          12,288
     BatchNorm3d-141         [4, 64, 8, 14, 24]             128
            ReLU-142         [4, 64, 8, 14, 24]               0
       SepConv3d-143         [4, 64, 8, 14, 24]               0
       MaxPool3d-144        [4, 512, 8, 14, 24]               0
          Conv3d-145         [4, 64, 8, 14, 24]          32,768
     BatchNorm3d-146         [4, 64, 8, 14, 24]             128
            ReLU-147         [4, 64, 8, 14, 24]               0
     BasicConv3d-148         [4, 64, 8, 14, 24]               0
        Mixed_4c-149        [4, 512, 8, 14, 24]               0
          Conv3d-150        [4, 128, 8, 14, 24]          65,536
     BatchNorm3d-151        [4, 128, 8, 14, 24]             256
            ReLU-152        [4, 128, 8, 14, 24]               0
     BasicConv3d-153        [4, 128, 8, 14, 24]               0
          Conv3d-154        [4, 128, 8, 14, 24]          65,536
     BatchNorm3d-155        [4, 128, 8, 14, 24]             256
            ReLU-156        [4, 128, 8, 14, 24]               0
     BasicConv3d-157        [4, 128, 8, 14, 24]               0
          Conv3d-158        [4, 256, 8, 14, 24]         294,912
     BatchNorm3d-159        [4, 256, 8, 14, 24]             512
            ReLU-160        [4, 256, 8, 14, 24]               0
          Conv3d-161        [4, 256, 8, 14, 24]         196,608
     BatchNorm3d-162        [4, 256, 8, 14, 24]             512
            ReLU-163        [4, 256, 8, 14, 24]               0
       SepConv3d-164        [4, 256, 8, 14, 24]               0
          Conv3d-165         [4, 24, 8, 14, 24]          12,288
     BatchNorm3d-166         [4, 24, 8, 14, 24]              48
            ReLU-167         [4, 24, 8, 14, 24]               0
     BasicConv3d-168         [4, 24, 8, 14, 24]               0
          Conv3d-169         [4, 64, 8, 14, 24]          13,824
     BatchNorm3d-170         [4, 64, 8, 14, 24]             128
            ReLU-171         [4, 64, 8, 14, 24]               0
          Conv3d-172         [4, 64, 8, 14, 24]          12,288
     BatchNorm3d-173         [4, 64, 8, 14, 24]             128
            ReLU-174         [4, 64, 8, 14, 24]               0
       SepConv3d-175         [4, 64, 8, 14, 24]               0
       MaxPool3d-176        [4, 512, 8, 14, 24]               0
          Conv3d-177         [4, 64, 8, 14, 24]          32,768
     BatchNorm3d-178         [4, 64, 8, 14, 24]             128
            ReLU-179         [4, 64, 8, 14, 24]               0
     BasicConv3d-180         [4, 64, 8, 14, 24]               0
        Mixed_4d-181        [4, 512, 8, 14, 24]               0
          Conv3d-182        [4, 112, 8, 14, 24]          57,344
     BatchNorm3d-183        [4, 112, 8, 14, 24]             224
            ReLU-184        [4, 112, 8, 14, 24]               0
     BasicConv3d-185        [4, 112, 8, 14, 24]               0
          Conv3d-186        [4, 144, 8, 14, 24]          73,728
     BatchNorm3d-187        [4, 144, 8, 14, 24]             288
            ReLU-188        [4, 144, 8, 14, 24]               0
     BasicConv3d-189        [4, 144, 8, 14, 24]               0
          Conv3d-190        [4, 288, 8, 14, 24]         373,248
     BatchNorm3d-191        [4, 288, 8, 14, 24]             576
            ReLU-192        [4, 288, 8, 14, 24]               0
          Conv3d-193        [4, 288, 8, 14, 24]         248,832
     BatchNorm3d-194        [4, 288, 8, 14, 24]             576
            ReLU-195        [4, 288, 8, 14, 24]               0
       SepConv3d-196        [4, 288, 8, 14, 24]               0
          Conv3d-197         [4, 32, 8, 14, 24]          16,384
     BatchNorm3d-198         [4, 32, 8, 14, 24]              64
            ReLU-199         [4, 32, 8, 14, 24]               0
     BasicConv3d-200         [4, 32, 8, 14, 24]               0
          Conv3d-201         [4, 64, 8, 14, 24]          18,432
     BatchNorm3d-202         [4, 64, 8, 14, 24]             128
            ReLU-203         [4, 64, 8, 14, 24]               0
          Conv3d-204         [4, 64, 8, 14, 24]          12,288
     BatchNorm3d-205         [4, 64, 8, 14, 24]             128
            ReLU-206         [4, 64, 8, 14, 24]               0
       SepConv3d-207         [4, 64, 8, 14, 24]               0
       MaxPool3d-208        [4, 512, 8, 14, 24]               0
          Conv3d-209         [4, 64, 8, 14, 24]          32,768
     BatchNorm3d-210         [4, 64, 8, 14, 24]             128
            ReLU-211         [4, 64, 8, 14, 24]               0
     BasicConv3d-212         [4, 64, 8, 14, 24]               0
        Mixed_4e-213        [4, 528, 8, 14, 24]               0
          Conv3d-214        [4, 256, 8, 14, 24]         135,168
     BatchNorm3d-215        [4, 256, 8, 14, 24]             512
            ReLU-216        [4, 256, 8, 14, 24]               0
     BasicConv3d-217        [4, 256, 8, 14, 24]               0
          Conv3d-218        [4, 160, 8, 14, 24]          84,480
     BatchNorm3d-219        [4, 160, 8, 14, 24]             320
            ReLU-220        [4, 160, 8, 14, 24]               0
     BasicConv3d-221        [4, 160, 8, 14, 24]               0
          Conv3d-222        [4, 320, 8, 14, 24]         460,800
     BatchNorm3d-223        [4, 320, 8, 14, 24]             640
            ReLU-224        [4, 320, 8, 14, 24]               0
          Conv3d-225        [4, 320, 8, 14, 24]         307,200
     BatchNorm3d-226        [4, 320, 8, 14, 24]             640
            ReLU-227        [4, 320, 8, 14, 24]               0
       SepConv3d-228        [4, 320, 8, 14, 24]               0
          Conv3d-229         [4, 32, 8, 14, 24]          16,896
     BatchNorm3d-230         [4, 32, 8, 14, 24]              64
            ReLU-231         [4, 32, 8, 14, 24]               0
     BasicConv3d-232         [4, 32, 8, 14, 24]               0
          Conv3d-233        [4, 128, 8, 14, 24]          36,864
     BatchNorm3d-234        [4, 128, 8, 14, 24]             256
            ReLU-235        [4, 128, 8, 14, 24]               0
          Conv3d-236        [4, 128, 8, 14, 24]          49,152
     BatchNorm3d-237        [4, 128, 8, 14, 24]             256
            ReLU-238        [4, 128, 8, 14, 24]               0
       SepConv3d-239        [4, 128, 8, 14, 24]               0
       MaxPool3d-240        [4, 528, 8, 14, 24]               0
          Conv3d-241        [4, 128, 8, 14, 24]          67,584
     BatchNorm3d-242        [4, 128, 8, 14, 24]             256
            ReLU-243        [4, 128, 8, 14, 24]               0
     BasicConv3d-244        [4, 128, 8, 14, 24]               0
        Mixed_4f-245        [4, 832, 8, 14, 24]               0
       MaxPool3d-246        [4, 832, 4, 14, 24]               0
       MaxPool3d-247         [4, 832, 4, 7, 12]               0
          Conv3d-248         [4, 256, 4, 7, 12]         212,992
     BatchNorm3d-249         [4, 256, 4, 7, 12]             512
            ReLU-250         [4, 256, 4, 7, 12]               0
     BasicConv3d-251         [4, 256, 4, 7, 12]               0
          Conv3d-252         [4, 160, 4, 7, 12]         133,120
     BatchNorm3d-253         [4, 160, 4, 7, 12]             320
            ReLU-254         [4, 160, 4, 7, 12]               0
     BasicConv3d-255         [4, 160, 4, 7, 12]               0
          Conv3d-256         [4, 320, 4, 7, 12]         460,800
     BatchNorm3d-257         [4, 320, 4, 7, 12]             640
            ReLU-258         [4, 320, 4, 7, 12]               0
          Conv3d-259         [4, 320, 4, 7, 12]         307,200
     BatchNorm3d-260         [4, 320, 4, 7, 12]             640
            ReLU-261         [4, 320, 4, 7, 12]               0
       SepConv3d-262         [4, 320, 4, 7, 12]               0
          Conv3d-263          [4, 32, 4, 7, 12]          26,624
     BatchNorm3d-264          [4, 32, 4, 7, 12]              64
            ReLU-265          [4, 32, 4, 7, 12]               0
     BasicConv3d-266          [4, 32, 4, 7, 12]               0
          Conv3d-267         [4, 128, 4, 7, 12]          36,864
     BatchNorm3d-268         [4, 128, 4, 7, 12]             256
            ReLU-269         [4, 128, 4, 7, 12]               0
          Conv3d-270         [4, 128, 4, 7, 12]          49,152
     BatchNorm3d-271         [4, 128, 4, 7, 12]             256
            ReLU-272         [4, 128, 4, 7, 12]               0
       SepConv3d-273         [4, 128, 4, 7, 12]               0
       MaxPool3d-274         [4, 832, 4, 7, 12]               0
          Conv3d-275         [4, 128, 4, 7, 12]         106,496
     BatchNorm3d-276         [4, 128, 4, 7, 12]             256
            ReLU-277         [4, 128, 4, 7, 12]               0
     BasicConv3d-278         [4, 128, 4, 7, 12]               0
        Mixed_5b-279         [4, 832, 4, 7, 12]               0
          Conv3d-280         [4, 384, 4, 7, 12]         319,488
     BatchNorm3d-281         [4, 384, 4, 7, 12]             768
            ReLU-282         [4, 384, 4, 7, 12]               0
     BasicConv3d-283         [4, 384, 4, 7, 12]               0
          Conv3d-284         [4, 192, 4, 7, 12]         159,744
     BatchNorm3d-285         [4, 192, 4, 7, 12]             384
            ReLU-286         [4, 192, 4, 7, 12]               0
     BasicConv3d-287         [4, 192, 4, 7, 12]               0
          Conv3d-288         [4, 384, 4, 7, 12]         663,552
     BatchNorm3d-289         [4, 384, 4, 7, 12]             768
            ReLU-290         [4, 384, 4, 7, 12]               0
          Conv3d-291         [4, 384, 4, 7, 12]         442,368
     BatchNorm3d-292         [4, 384, 4, 7, 12]             768
            ReLU-293         [4, 384, 4, 7, 12]               0
       SepConv3d-294         [4, 384, 4, 7, 12]               0
          Conv3d-295          [4, 48, 4, 7, 12]          39,936
     BatchNorm3d-296          [4, 48, 4, 7, 12]              96
            ReLU-297          [4, 48, 4, 7, 12]               0
     BasicConv3d-298          [4, 48, 4, 7, 12]               0
          Conv3d-299         [4, 128, 4, 7, 12]          55,296
     BatchNorm3d-300         [4, 128, 4, 7, 12]             256
            ReLU-301         [4, 128, 4, 7, 12]               0
          Conv3d-302         [4, 128, 4, 7, 12]          49,152
     BatchNorm3d-303         [4, 128, 4, 7, 12]             256
            ReLU-304         [4, 128, 4, 7, 12]               0
       SepConv3d-305         [4, 128, 4, 7, 12]               0
       MaxPool3d-306         [4, 832, 4, 7, 12]               0
          Conv3d-307         [4, 128, 4, 7, 12]         106,496
     BatchNorm3d-308         [4, 128, 4, 7, 12]             256
            ReLU-309         [4, 128, 4, 7, 12]               0
     BasicConv3d-310         [4, 128, 4, 7, 12]               0
        Mixed_5c-311        [4, 1024, 4, 7, 12]               0
     BackBoneS3D-312  [[-1, 1024, 4, 7, 12], [-1, 832, 8, 14, 24], [-1, 480, 16, 28, 48], [-1, 192, 16, 56, 96]]               0
          Conv3d-313         [4, 832, 4, 7, 12]       7,667,712
            ReLU-314         [4, 832, 4, 7, 12]               0
        Upsample-315        [4, 832, 4, 14, 24]               0
        Upsample-316        [4, 832, 4, 14, 24]               0
        Upsample-317        [4, 832, 4, 14, 24]               0
        Upsample-318        [4, 832, 4, 14, 24]               0
        Upsample-319        [4, 832, 4, 14, 24]               0
          Conv3d-320        [4, 480, 4, 14, 24]      10,782,720
            ReLU-321        [4, 480, 4, 14, 24]               0
        Upsample-322        [4, 480, 4, 28, 48]               0
        Upsample-323        [4, 480, 4, 28, 48]               0
        Upsample-324        [4, 480, 4, 28, 48]               0
        Upsample-325        [4, 480, 4, 28, 48]               0
        Upsample-326        [4, 480, 4, 28, 48]               0
          Conv3d-327        [4, 192, 4, 28, 48]       4,147,200
            ReLU-328        [4, 192, 4, 28, 48]               0
        Upsample-329        [4, 192, 4, 56, 96]               0
        Upsample-330        [4, 192, 4, 56, 96]               0
        Upsample-331        [4, 192, 4, 56, 96]               0
        Upsample-332        [4, 192, 4, 56, 96]               0
        Upsample-333        [4, 192, 4, 56, 96]               0
          Conv3d-334         [4, 64, 4, 56, 96]         552,960
            ReLU-335         [4, 64, 4, 56, 96]               0
        Upsample-336       [4, 64, 4, 112, 192]               0
        Upsample-337       [4, 64, 4, 112, 192]               0
        Upsample-338       [4, 64, 4, 112, 192]               0
        Upsample-339       [4, 64, 4, 112, 192]               0
        Upsample-340       [4, 64, 4, 112, 192]               0
          Conv3d-341       [4, 32, 2, 112, 192]          36,864
            ReLU-342       [4, 32, 2, 112, 192]               0
        Upsample-343       [4, 32, 2, 224, 384]               0
        Upsample-344       [4, 32, 2, 224, 384]               0
        Upsample-345       [4, 32, 2, 224, 384]               0
        Upsample-346       [4, 32, 2, 224, 384]               0
        Upsample-347       [4, 32, 2, 224, 384]               0
          Conv3d-348       [4, 32, 1, 224, 384]           2,048
            ReLU-349       [4, 32, 1, 224, 384]               0
          Conv3d-350        [4, 1, 1, 224, 384]              33
         Sigmoid-351        [4, 1, 1, 224, 384]               0
   DecoderConvUp-352              [4, 224, 384]               0
================================================================
Total params: 31,099,585
Trainable params: 31,099,585
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 126.00
Forward/backward pass size (MB): 61572651134299.81
Params size (MB): 118.64
Estimated Total Size (MB): 61572651134544.45
----------------------------------------------------------------
